In [2]:
import pandas as pd

In [9]:
df = pd.read_table('Datasets/data2.txt')

In [10]:
df

    Tom,80,M
0   Tim,85,M
1   Kim,70,M
2  Kate,90,F
3  Alex,75,F

In [11]:
df = pd.read_table('Datasets/data2.txt', sep = ',')

In [12]:
df

    Tom  80  M
0   Tim  85  M
1   Kim  70  M
2  Kate  90  F
3  Alex  75  F

In [13]:
df.reindex(['A', 'B', 'C'])

   Tom  80    M
A  NaN NaN  NaN
B  NaN NaN  NaN
C  NaN NaN  NaN

In [16]:
df = pd.read_table('Datasets/data2.txt', names = ["names", "score", "gender"], sep = ',')
df

  names  score gender
0   Tom     80      M
1   Tim     85      M
2   Kim     70      M
3  Kate     90      F
4  Alex     75      F

In [17]:
df = pd.read_table('Datasets/data2.txt', index_col='names', sep = ',', names = ['names', 'score', 'gender'])
df

       score gender
names
Tom       80      M
Tim       85      M
Kim       70      M
Kate      90      F
Alex      75      F

In [20]:
df = pd.read_table('Datasets/data3.txt', sep=',', index_col=['lesson', 'name'])
df

             one  two
lesson name
Math   Kim    80   85
       Tim    90   70
       Tom    70   95
Stat   Kate   65   90
       Alex   85   80
       Sam    55   70

In [32]:
df.loc['Math']

      one  two
name
Kim    80   85
Tim    90   70
Tom    70   95

In [34]:
df3=pd.read_table("Datasets/data4.txt",sep=",")
df3

                          #hello
name                score    sex
#scores of students NaN      NaN
Tim                 80         M
Kate                85         F
Alex                70         M
Tom                 90         M
Kim                 75         F

In [35]:
df3.shape

(7, 1)

In [36]:
df3.columns

Index(['#hello'], dtype='object')

In [37]:
df3 = pd.read_table("Datasets/data4.txt", sep = ",", skiprows=[0,2])
df3

   name  score sex
0   Tim     80   M
1  Kate     85   F
2  Alex     70   M
3   Tom     90   M
4   Kim     75   F

In [38]:
df3.columns

Index(['name', 'score', 'sex'], dtype='object')

In [39]:
df3 = pd.read_table('Datasets/data4.txt', sep = ',', skiprows=[0,2], usecols=[0,1])
df3

   name  score
0   Tim     80
1  Kate     85
2  Alex     70
3   Tom     90
4   Kim     75

In [40]:
df3 = pd.read_table('Datasets/data4.txt', sep = ',', skiprows=[0,2], usecols=[0,1], nrows=3)
df3

   name  score
0   Tim     80
1  Kate     85
2  Alex     70

### Writing Data

In [44]:
df = pd.read_csv('Datasets/data.txt', sep = '\t')
df

  name  score sex
0  Tim     80   M
1  Tom     85   M
2  Kim     70   F
3  Sam     90   M
4  Efe     75   M

In [46]:
df.to_csv("Datasets/new_data.csv")